In [2]:
import tkinter as tk
from tkinter import ttk
win=tk.Tk()
win.title("Painting by Arman")

c=Canvas(win, height=200, width=300, bg="yellow")

l=c.create_line(28,53,95,135, fill="red")

o=c.create_oval(0,0,25,35,28,40,0,0, fill="blue")

a=c.create_arc(0,0,45,45,34,56, fill="green")

c.grid()
mailoop()

NameError: name 'Canvas' is not defined

In [ ]:
from tkinter import *


root = Tk()

C = Canvas(root, bg="yellow",
		height=250, width=300)

line = C.create_line(108, 120,
					320, 40,
					fill="green")

arc = C.create_arc(180, 150, 80,
				210, start=0,
				extent=220,
				fill="red")

oval = C.create_oval(80, 30, 140,
					150,
					fill="blue")

C.pack()
mainloop()

In [ ]:
import tkinter as tk
from tkinter import ttk
win=tk.Tk()
win.title("Button")

label1=tk.Label(win, text="Enter your name: ").grid(row=0, column=0, sticky=tk.W)
button=tk.Button(win, text="click here", bg="blue",).grid(row=5, column=5)

#checkbutton=CheckButton(win, text="male").grid()
entry=tk.Entry(win, text="Enter your name").grid(row=0, column=0)
canvas=tk.Canvas(win).grid()
win.geometry("300x300")
win.mainloop()

# registration form

In [3]:
import tkinter as tk
from tkinter import ttk

win=tk.Tk()
win.title("Registration form")
win.geometry("300x300")

#label
l_head=ttk.Label(win, text = "Noida institute of Engineering & Technology", font=50 ).grid(row=0, column=1)
l_name=ttk.Label(win, text = "Enter your name: ").grid(row=1, column=0, sticky=W)
l_colleg=ttk.Label(win, text = "Enter your college name: ").grid(row=2, column=0, sticky=W)
l_button=ttk.Button(win, text = "Submit").grid(row=5, column=1,sticky=W)

#entry
name=ttk.Entry(win).grid(row=1, column=1, sticky=tk.W)
#name.focus()
college=ttk.Entry(win).grid(row=2, column=1, sticky=tk.W)
#button=ttk.Entry(win)

frame=Frame(win).grid(sticky=W)

button_1= Button(frame, text="NIET",fg="blue",font=50).grid(row=0,column=0)


win.mainloop()

NameError: name 'W' is not defined

# frame

In [ ]:
import tkinter as tk
from tkinter import ttk

win=tk.Tk()
win.resizable(height=50, width=100)
win.title("Framing")

label=ttk.Label(win, text="Noida institute of engineering and technology", font=50,).grid(row=0, column=1)

frame=Frame(win).grid()
b_1=Button(frame, text="Mohammad",fg="red", bg="yellow").grid(row=1,  column=0, sticky=tk.W)
b_2=Button(frame, text="Arman",fg="red", bg="yellow").grid(row=1,  column=1, sticky=tk.W)

win.resizable(True, True)


win.mainloop()

In [4]:
import tkinter as tk
from tkinter import ttk

win = tk.Tk()
win.title("niet")
win.geometry("250x350")

l1=ttk.Label(win, text="I am an Indian").grid()

def clicked():
    l1.configure(text="I am arman")
    
button=ttk.Button(win, text = "click me", command=clicked)

button.grid(row=0, column=1)

win.mainloop()

Exception in Tkinter callback
Traceback (most recent call last):
  File "C:\Users\DELL\anaconda3\lib\tkinter\__init__.py", line 1892, in __call__
    return self.func(*args)
  File "C:\Users\DELL\AppData\Local\Temp/ipykernel_3288/205305846.py", line 11, in clicked
    l1.configure(text="I am arman")
AttributeError: 'NoneType' object has no attribute 'configure'
Exception in Tkinter callback
Traceback (most recent call last):
  File "C:\Users\DELL\anaconda3\lib\tkinter\__init__.py", line 1892, in __call__
    return self.func(*args)
  File "C:\Users\DELL\AppData\Local\Temp/ipykernel_3288/205305846.py", line 11, in clicked
    l1.configure(text="I am arman")
AttributeError: 'NoneType' object has no attribute 'configure'
Exception in Tkinter callback
Traceback (most recent call last):
  File "C:\Users\DELL\anaconda3\lib\tkinter\__init__.py", line 1892, in __call__
    return self.func(*args)
  File "C:\Users\DELL\AppData\Local\Temp/ipykernel_3288/205305846.py", line 11, in clicked
    l1.configure(text="I am arman")
AttributeError: 'NoneType' object has no attribute 'configure'

In [ ]:
import numpy as np
m = np.array([[2,4],[5,4]])
m

In [ ]:
n = np.array([[12,45],[15,4]])
n

In [ ]:
m + n

In [ ]:
m *n

In [ ]:
a= m + n
a.T

In [ ]:
n[0,1]

In [ ]:
m

In [ ]:
n

In [ ]:
k = np.array([[1,2,3,4]])
k

In [ ]:
k[0,1]

In [ ]:
k[0]

In [ ]:
k.shape

In [ ]:
k[0,2] = 4

In [ ]:
k.size

In [ ]:
z_matrix = np.zeros((2,3))

In [ ]:
z_matrix

In [ ]:
mat = (np.arange(5),np.arange(5))
print(mat)

In [ ]:
M = np.arange(5,10,2)
print(M)

In [ ]:
s = np.linspace(5,10,20)
s

In [ ]:
i = np.identity(5)
i

In [ ]:
nul = np.zeros((2,10))
nul

In [ ]:
print(nul.shape)
print(nul.size)

In [ ]:
line = np.linspace(0,100,21)
line

In [ ]:
emp = np.empty((2,3))
emp

In [ ]:
empty = np.empty((2,3))
empty

In [ ]:
ar = np.arange(64)
ar

In [ ]:
print(ar.shape)
print(ar.reshape(8,8))
print("shape",ar.shape)

In [ ]:
ar.shape
ar.nbytes

In [ ]:
a

In [ ]:
a.ravel()

In [ ]:
ar.ravel()

In [ ]:
ar.shape

In [ ]:
print(a.reshape(1,4))
print(a.reshape(4,1))

In [ ]:
m_1 = ([[1,22,3],[64,54,6],[78,8,94]])
m1=np.array(m_1)
m1

In [ ]:
print(m1.sum(axis = 0))
print(m1.sum(axis = 1))

In [ ]:
m1.argmin()
m1.argmax()
m1.nbytes
m1.argsort()

In [ ]:
print(m1)
print(m1.argsort())
print(m1.ravel())

In [ ]:
m1.ravel()

In [ ]:
m1.argmax(axis = 0)

In [ ]:
(m1.argsort())

In [ ]:
m1.ravel()

In [ ]:
np.sqrt(m1)

In [ ]:
print(m1)
print(np.where(m1 > 50))

In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1= {
    
    "Subject":['Math',"Physics","Chemistry"],
    "Marks":[89,91,65]
    
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df  #df = pd.DataFrame(dict1)

     Subject  Marks
0       Math     89
1    Physics     91
2  Chemistry     65

In [6]:
df.max()

Subject    Physics
Marks           91
dtype: object

In [7]:
df.head(2)

   Subject  Marks
0     Math     89
1  Physics     91

In [8]:
df.to_csv("marks_arman.csv",index=False)

In [10]:
file = pd.read_csv("marks_arman.csv")
file

     Subject  Marks
0       Math     89
1    Physics     91
2  Chemistry     65

In [14]:
file.index=["first","second","third"]
file

          Subject  Marks
first        Math     89
second    Physics     91
third   Chemistry     65

In [17]:
import numpy as np
import pandas as pd

In [19]:
dict2 = {
    "Name":["Mohammad Firdosh","Mohammad Arman", "Mohammad Wasim", "Reshman Khatoon,","Saniya Khatoon","Mohammad Faishal","Fariya Khatoon","Aafreen Khatoon","Samreen"],
    "Age":[19,18,17,16,15,14,12,10,9],
    "Persue":["Hafiz","B.tech","I.A","B.A","B.A","Amu 9th","7th class","5th class","4th class"]
    
}

In [20]:
dict2file = pd.DataFrame(dict2)
dict2file

               Name  Age     Persue
0  Mohammad Firdosh   19      Hafiz
1    Mohammad Arman   18     B.tech
2    Mohammad Wasim   17        I.A
3  Reshman Khatoon,   16        B.A
4    Saniya Khatoon   15        B.A
5  Mohammad Faishal   14    Amu 9th
6    Fariya Khatoon   12  7th class
7   Aafreen Khatoon   10  5th class
8           Samreen    9  4th class

In [30]:
dict2file.index=[1,2,3,4,5,6,7,8,9]
dict2file

               Name  Age     Persue
1  Mohammad Firdosh   19      Hafiz
2    Mohammad Arman   18     B.tech
3    Mohammad Wasim   17        I.A
4  Reshman Khatoon,   16        B.A
5    Saniya Khatoon   15        B.A
6  Mohammad Faishal   14    Amu 9th
7    Fariya Khatoon   12  7th class
8   Aafreen Khatoon   10  5th class
9           Samreen    9  4th class

In [56]:
dict2file.to_csv("Family.csv",index = False)

In [46]:
dict2file[("Name")]

1    Mohammad Firdosh
2      Mohammad Arman
3      Mohammad Wasim
4    Reshman Khatoon,
5      Saniya Khatoon
6    Mohammad Faishal
7      Fariya Khatoon
8     Aafreen Khatoon
9             Samreen
Name: Name, dtype: object

In [52]:
dict2file["Age"][8] = 8

C:\Users\DELL\AppData\Local\Temp/ipykernel_11060/1584379606.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dict2file["Age"][8] = 8

In [53]:
dict2file

               Name  Age     Persue
1  Mohammad Firdosh   19      Hafiz
2    Mohammad Arman   18     B.tech
3    Mohammad Wasim   17        I.A
4  Reshman Khatoon,   16        B.A
5    Saniya Khatoon   15        B.A
6  Mohammad Faishal   14    Amu 9th
7    Fariya Khatoon   12  7th class
8   Aafreen Khatoon    8  5th class
9           Samreen    8  4th class

In [55]:
dict2file.describe()

             Age
count   9.000000
mean   14.111111
std     4.044887
min     8.000000
25%    12.000000
50%    15.000000
75%    17.000000
max    19.000000

In [58]:
file5 = pd.read_csv("Family.csv")
file5

               Name  Age     Persue
0  Mohammad Firdosh   19      Hafiz
1    Mohammad Arman   18     B.tech
2    Mohammad Wasim   17        I.A
3  Reshman Khatoon,   16        B.A
4    Saniya Khatoon   15        B.A
5  Mohammad Faishal   14    Amu 9th
6    Fariya Khatoon   12  7th class
7   Aafreen Khatoon    8  5th class
8           Samreen    8  4th class

In [60]:
file5.index = [1,2,3,4,5,6,7,8,9]
file5

               Name  Age     Persue
1  Mohammad Firdosh   19      Hafiz
2    Mohammad Arman   18     B.tech
3    Mohammad Wasim   17        I.A
4  Reshman Khatoon,   16        B.A
5    Saniya Khatoon   15        B.A
6  Mohammad Faishal   14    Amu 9th
7    Fariya Khatoon   12  7th class
8   Aafreen Khatoon    8  5th class
9           Samreen    8  4th class